app/controllers/contacts_controller.rb

SELECT * FROM "contacts" LIMIT 0 OFFSET 0
---
  def index
    #@contacts = Contact.all
    from = params[:from]
    range_length = params[:length]

    respond_to do |format|
      #contacts = @contacts.map {|contact| json_for_contact(contact) }
	  contacts = Contact.all(:offset => from.to_i, :limit => range_length.to_i).map { |contact| json_for_contact(contact) }

SELECT * FROM "contacts" WHERE ("contacts"."id" = 0)
---
  def show
    @contact = Contact.find(params[:id])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("dob", "updated_at", "order", "lname", "fname", "created_at") VALUES('2005-01-07 05:39:00', '2010-01-07 05:41:05', 1, 'Somers', 'Michael', '2010-01-07 05:41:05')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 4)
UPDATE "contacts" SET "dob" = '01-01-1980', "updated_at" = '2010-01-23 02:57:37' WHERE "id" = 1
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 5)
DELETE FROM "contacts" WHERE "id" = 5
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy